In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('titanic.csv')

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df_new = df.drop(columns = ['PassengerId', 'Name', 'SibSp'])

In [8]:
df_new.drop(columns = ['Parch', 'Ticket', 'Cabin', 'Embarked'], inplace = True)

In [9]:
df_new

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [10]:
inputs = df_new.drop('Survived', axis = 'columns')

In [11]:
target = df_new['Survived']

In [12]:
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [13]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [14]:
#now convert sex column to the number form using labelEncoder from sklearn
from sklearn.preprocessing import LabelEncoder
sex_le = LabelEncoder()

In [15]:
df_new['sex_n'] = sex_le.fit_transform(df_new['Sex'])

In [16]:
df_new

     Survived  Pclass     Sex   Age     Fare  sex_n
0           0       3    male  22.0   7.2500      1
1           1       1  female  38.0  71.2833      0
2           1       3  female  26.0   7.9250      0
3           1       1  female  35.0  53.1000      0
4           0       3    male  35.0   8.0500      1
..        ...     ...     ...   ...      ...    ...
886         0       2    male  27.0  13.0000      1
887         1       1  female  19.0  30.0000      0
888         0       3  female   NaN  23.4500      0
889         1       1    male  26.0  30.0000      1
890         0       3    male  32.0   7.7500      1

[891 rows x 6 columns]

In [17]:
df_new.drop('Sex', axis = 1, inplace = True)

In [39]:
df_new

     Survived  Pclass   Age     Fare  sex_n
0           0       3  22.0   7.2500      1
1           1       1  38.0  71.2833      0
2           1       3  26.0   7.9250      0
3           1       1  35.0  53.1000      0
4           0       3  35.0   8.0500      1
..        ...     ...   ...      ...    ...
886         0       2  27.0  13.0000      1
887         1       1  19.0  30.0000      0
888         0       3   NaN  23.4500      0
889         1       1  26.0  30.0000      1
890         0       3  32.0   7.7500      1

[891 rows x 5 columns]

In [41]:
df_new['Fare'] = df_new['Fare'].astype(int)

In [42]:
#now draw tree
df_new

     Survived  Pclass   Age  Fare  sex_n
0           0       3  22.0     7      1
1           1       1  38.0    71      0
2           1       3  26.0     7      0
3           1       1  35.0    53      0
4           0       3  35.0     8      1
..        ...     ...   ...   ...    ...
886         0       2  27.0    13      1
887         1       1  19.0    30      0
888         0       3   NaN    23      0
889         1       1  26.0    30      1
890         0       3  32.0     7      1

[891 rows x 5 columns]

In [43]:
mean_v = df_new['Age'].mean()

In [44]:
df_new['Age'] = df_new['Age'].fillna(value = mean_v)
df_new

     Survived  Pclass        Age  Fare  sex_n
0           0       3  22.000000     7      1
1           1       1  38.000000    71      0
2           1       3  26.000000     7      0
3           1       1  35.000000    53      0
4           0       3  35.000000     8      1
..        ...     ...        ...   ...    ...
886         0       2  27.000000    13      1
887         1       1  19.000000    30      0
888         0       3  29.699118    23      0
889         1       1  26.000000    30      1
890         0       3  32.000000     7      1

[891 rows x 5 columns]

In [73]:
from sklearn.tree import DecisionTreeClassifier

In [46]:
df_new.isna().sum()

Survived    0
Pclass      0
Age         0
Fare        0
sex_n       0
dtype: int64

In [47]:
df_new.Age = df_new.Age.astype(int)

In [26]:
model = tree.DecisionTreeClassifier()

In [48]:
model.fit(df_new, target)

DecisionTreeClassifier()

In [49]:
model.score(df_new, target)

1.0

# Decision tree score without train_test : 1.0

In [50]:
#using train_test_split
from sklearn.model_selection import train_test_split

In [51]:
X_train, X_test, y_train, y_test = train_test_split(df_new, target, test_size = 0.2)

In [52]:
len(X_train)

712

# Decision Tree

In [53]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [54]:
model.score(X_test, y_test)

1.0

# Score of Decision Tree with train_test : 1.0

In [55]:
from sklearn.linear_model import LogisticRegression

In [56]:
l = LogisticRegression()
l.fit(X_train, y_train)
l.score(X_test, y_test)

1.0

# Score with Logistic Regression: 1.0

# Doing Cross Validation

In [59]:
from sklearn.model_selection import cross_val_score

In [61]:
from sklearn.svm import SVC
from sklearn.ensemble import RandomForestClassifier
import numpy as np

In [68]:
DT = cross_val_score(SVC(), X_train, y_train, cv = 3)
np.average(DT)

0.6503327069224315

In [70]:
RF = cross_val_score(RandomForestClassifier(), X_train, y_train, cv = 3)
np.average(RF)

1.0

In [71]:
LR =  cross_val_score(LogisticRegression(), X_train, y_train, cv = 3)
np.average(LR)

1.0

In [74]:
DT =  cross_val_score(DecisionTreeClassifier(), X_train, y_train, cv = 3)
np.average(DT)

1.0

# 100% Accuracy with these models